app/Controllers/LoginController.php

SELECT *
FROM `employee`
WHERE `email` = 'u@gmail.com'
AND `password` = 'hello'
 LIMIT 1
---
    public function signin()
    {

        $username=$this->request->getPost('username');
        $password=$this->request->getPost('password');
        $users = new EmployeeModel();
        $check=$users->userExists($username,$password);

        if($check==True)
        {
        $user = $users->where('email', $username)->where('password', $password)->first();