app/Controllers/ProfileController.php

SELECT *
FROM `employee`
WHERE `email` = 'u@gmail.com'
 LIMIT 1
---
    public function index(): string
    {

        $user = new EmployeeModel();
        $profileData = $user->where('email', session()->get('email'))->first();