app/Models/EmployeeModel.php

SELECT *
FROM `employee`
WHERE `email` = 'u@gmail.com'
AND `password` = 'hello'
 LIMIT 1
---
    public function userExists($email,$password)
    {
        return $this->where('email', $email)->where('password', $password)->first();